#+TITLE: My Java

* Hello World
#+begin_SRC java
public
class Ola_mundo {
public
  static void main(String[] args) { System.out.print("Ola Mundo!"); }
}
#+end_SRC

#+RESULTS:
: Ola Mundo!
* For
#+begin_SRC java
String[] array = {"Sandes de Atum", "Chocolate", "Arroz"};

int array_[][] = {{1, 1, 1}, {2, 2, 2}};

for (int i = 0; i < array.length; i++)
  System.out.print(array[i] + " ");

System.out.print("\n");

for (String elem : array)
  System.out.print(elem + " ");

System.out.print("\n");

int sfinal = 0;

// Somar todos os elementos da matriz
for (int[] l_elem : array_)
  for (int elem : l_elem)
    sfinal += elem;
System.out.print(sfinal);
#+end_SRC

#+RESULTS:
: Sandes de Atum Chocolate Arroz
: Sandes de Atum Chocolate Arroz
: 9
* Tipos de acesso
** Public
+ qualquer classe
** Protected
+ própria classe,qualquer classe do mesmo package e qualquer subclasse
** Private
+ própria classe
** Nenhum
+ própria classe e classes dentrodo mesmo package
